.emacs.d/jds-config.org
#+Title: Jason Sewall's Emacs config
#+OPTIONS: toc:4 h:4
#+PROPERTY: header-args:emacs-lisp :tangle init.el


* Cheatsheet — trying out the modern stack

A running guide. Keep updated as packages change. Nothing in this
section tangles (no source blocks); it's documentation.

** Completion: minibuffer (vertico stack)

Vertico is the vertical minibuffer UI; marginalia adds annotations;
orderless lets you type out-of-order substrings (space separator);
consult adds richer commands; embark acts on whatever you've selected.

- =M-x= , =C-x b= , =C-x C-f= — already vertico-powered; just type
  partial words in any order
- =C-x b= (=consult-buffer=) — switch buffer with live preview
- =C-x C-r= (=consult-recent-file=) — recent files
- =M-s f= or =M-g g= (=consult-line=) — fuzzy-search current buffer
- =M-g r= (=consult-ripgrep=) — ripgrep across the project
- =M-g i= (=consult-imenu=) — jump to function/heading by name
- =M-g o= (=consult-outline=) — outline navigation
- =M-y= (=consult-yank-pop=) — visual kill-ring
- =C-c o= or =C-.= (=embark-act=) — act on target at point
  (file → dired/copy/attach; buffer → kill/rename; URL → browse…)
- =M-o= inside the minibuffer — =embark-act= on the current candidate
- =C-x M-r= (=vertico-repeat=) — re-run last completion session
- type =!foo= in minibuffer — exclude matches containing "foo"
  (orderless dispatcher); =foo== — match "foo" literally

** Completion: in-buffer (corfu + cape)

Corfu now =:custom corfu-auto t= so the popup triggers as you type.
Pause to see =corfu-popupinfo= docs. =cape= adds dabbrev/file/keyword
sources to =completion-at-point-functions=.

- (just type) — corfu popup; arrows / =C-n=/=C-p= to navigate; =RET=
  accepts; =TAB= cycles
- =C-M-i= (=completion-at-point=) — force completion (file paths,
  dabbrev expansions, etc., from cape)
- =M-/= (=hippie-expand=) — old-school stepwise expansion fallback

** LSP / diagnostics (eglot + flymake + eldoc-box)

- visit a code buffer in a configured mode (C/C++/CUDA/Rust/Python) —
  eglot starts automatically via the per-mode hooks
- =M-.= / =M-?= — jump to definition / find references
- =M-x eglot-rename= — rename across the project
- =M-x eglot-code-actions= — quick fixes / refactors
- =M-n= / =M-p= — next/previous flymake diagnostic
- =C-c != — echo flymake diagnostic(s) for the *current line*
  (just put point anywhere on the line — no need to be inside the
  underlined span)
- =C-c ! l= — flymake buffer diagnostics list
- when point is on a line with diagnostics, the message also shows
  in =eldoc-box= automatically (we replaced flymake's point-only
  eldoc reporter with a line-aware one — see
  =jds/flymake-eldoc-on-line=)
- =C-h .= — eldoc-box: float a child frame with signature/docs
  (instead of cramped echo area); auto-on in eglot buffers
- rustic buffers also have =C-c C-c a/r/q/Q= for code-actions/rename/
  reconnect/shutdown, and =C-c C-c l= for diagnostics

** Python (uv-first)

Prerequisites on =$PATH= (install via uv or pipx):

#+begin_example
uv tool install basedpyright   # LSP (types, hover, rename)
uv tool install ruff           # format + lint
uv tool install mypy           # second type checker
uv tool install ty             # third type checker (Astral, alpha)
#+end_example

In a project:

- =uv venv= creates =.venv/= — that's all =pet= needs to wire up
- open any =.py= file:
  - =pet-mode= picks up =.venv/= and points pyvenv, eglot, mypy, ty
    at the right interpreter
  - =eglot= starts with basedpyright → hover docs, completion,
    rename, code actions
  - =flymake= shows three streams of diagnostics inline:
    basedpyright (LSP) + mypy (=flymake-mypy=) + ty
    (=jds/flymake-ty-backend=); each ty diagnostic is tagged =[ty]=
  - =apheleia= runs =ruff format= on save
- =M-x pet-verify-setup= — diagnose which tools/venv pet found
- =M-x jds/python-check-tools= — list any missing CLI tools with
  =uv tool install ...= hints. Auto-runs the first time a Python
  buffer opens this session; pops the =*python-tools*= buffer if
  anything's missing. =C-u M-x jds/python-check-tools= forces a
  re-check after you've installed things.
- the modeline shows =venv:NAME= when a venv is active

** Tree-sitter (treesit-auto)

- visit any =.c=/=.rs=/=.go=/etc. file — you'll be prompted once to
  install the grammar, then the buffer uses the =-ts-mode= variant
- =M-x treesit-auto-install-all= — pre-install everything

** Markdown / TOML / YAML

Tree-sitter modes for the structure, eglot for the smarts.
Install the language servers on your =$PATH= (pick whichever
package manager you use):

#+begin_example
# macOS (Homebrew)
brew install pandoc marksman taplo yaml-language-server

# Linux — Debian/Ubuntu
sudo apt install pandoc
# marksman, taplo, yaml-language-server usually not in apt; use:

# Cross-platform fallbacks
cargo install taplo-cli --features lsp
npm install -g yaml-language-server
# marksman: grab a release from
#   https://github.com/artempyanykh/marksman/releases
# and drop it on $PATH (chmod +x it).
#+end_example

- =markdown-mode= (=.md=): pandoc-mode for export, visual-line-mode
  for wrap, native code-block fontification, marksman for hover/refs
- =M-x jds/markdown-reading-mode= — toggle prose-friendly view:
  hides =*=/=_=/=[]()= markup, switches to proportional font (code
  stays monospace), centers a narrow column. Same again to leave.
- =C-c C-c l= — toggle =markdown-live-preview-mode= (renders via
  =pandoc -f gfm -t html5= and shows the result in a side EWW
  buffer that refreshes as you type). Fully local — no server, no
  token, no network.
- =C-c C-c p= — one-shot preview in your default browser
- =C-c C-c v= — export to file + open in browser
- =toml-ts-mode= (=.toml=): taplo gives schema-aware diagnostics
  (=pyproject.toml=, =Cargo.toml=)
- =yaml-ts-mode= (=.yaml=/=.yml=): yaml-language-server validates
  against schemas; pinned to 2-space indent
- =C-c C-c= in pandoc-mode — convert/export via Pandoc

** Projects (built-in project.el — replaces projectile)

The new prefix is =C-x p=. Bindings to remember:

- =C-x p f= — find file in project
- =C-x p g= — grep
- =C-x p r= — query-replace across project
- =C-x p p= — switch project
- =C-x p b= — buffer in project
- =C-x p s= / =C-x p e= — shell / eshell in project
- =C-x p D= — dired the project root
- =C-x p k= — kill all project buffers

** VCS

- =C-x C-g= — =magit-status=
- =C-c m l= — =git-link= (copy URL to current line on the remote)
- =yadm= as a TRAMP method: =C-x C-f /yadm:enter:~/.gitconfig=

** Editing

- =C-x u= (=vundo=) — visualize undo tree; =p/n/f/b= to navigate,
  =q= to exit, =RET= to commit
- =M-2= (=er/expand-region=) — expand selection by syntactic unit
- =C-x m= — multiple-cursors hydra (=l= edit lines, =a= mark all,
  =n/p= mark next/prev, =r= mark all in regex)
  - while multi-cursors are live, =C-s= becomes phi-search (works
    across all cursors)
- =M-3= / =M-4= — quick mark next/prev like this
- =M-SPC= — =cycle-spacing= (toggle 0/1/many spaces)
- =C-c t= — transpose at whitespace
- =C-a= — smart beginning-of-line (toggles indentation vs. column 0)
- =C-x M-q= — unfill paragraph (one line)

** Snippets

- =yas-insert-snippet= or just type a trigger + =TAB=
- snippets live in =~/.emacs.d/snippets/=

** Window / frame nav

- =C-x w= — =hydra-window= (then =b= switch-buffer, =f= find-file,
  =h/j/k/l= move, =v/x= split, =a= ace-jump, =s= swap, =o= delete
  others, =d= delete, =z= winner-undo, =Z= winner-redo)
- =M-g= — =hydra-avy= (=c= char, =C= 2-char, =w= word, =s= subword,
  =u= follow URI)
- =repeat-mode= is on: after =C-x o= (other-window), keep pressing
  =o= to keep cycling. Works for many prefixed commands.

** Workspaces (tab-bar-mode)

Built-in workspaces; tabs are *window configurations*, not buffers.

- =C-x t 2= — new tab
- =C-x t 0= — close current tab
- =C-x t o= — next tab; =C-x t O= — previous
- =C-x t r= — rename tab
- =C-x t b= — switch to buffer in another tab
- =C-x t RET= / =C-x t <N>= — jump to tab by name / number

** Search

- =C-s= / =C-r= — isearch (plain); =TAB= during isearch hands off to
  =consult-line=
- rg.el bindings via =rg-enable-default-bindings= prefix =C-c s=

** Themes

- =M-x ef-themes-select= — browse all variants with live preview
- =M-x ef-themes-toggle= — flip between =ef-dream= ↔ =ef-frost=
- adjust the toggle pair: =(setq ef-themes-to-toggle '(THEME-A THEME-B))=

** Org-mode

- =C-c '= (=org-edit-special=) — edit a src block in its own buffer
- =C-c C-v t= (=org-babel-tangle=) — tangle (also auto-tangle on
  save of this file via =jds/tangle-jds-config-on-save=)
- =org-modern-mode= is on in org buffers — cosmetic
- =org-appear-mode= is on — when point lands on =*bold*=/=/italic/=/
  links, the raw markup briefly reveals so you can edit it

** Lisp REPLs

- =M-x sly= — start a Common Lisp REPL (sbcl); =M-.= jumps, =C-c
  C-k= compile buffer, =C-c C-c= compile defun
- =M-x ielm= — Emacs Lisp REPL (built-in)

** Learning the stack

- =M-x jds/tip= — pop a random tip drawn from THIS cheatsheet. Also
  auto-fires once on Emacs startup (small window; =q= to dismiss).
  Add a bullet here → it's in the rotation next time.

** Misc

- =<f9>= — ibuffer
- =<f10>= — =consult-menu-bar= (search menu commands)
- =C-c g= — goto-line
- =C-x C-c C-v= — actually quit Emacs (=C-x C-c= is unbound to
  prevent butterfinger exits)
- =hydra-desktop/body= — desktop save/restore/clear
- =minions-mode= clicks the modeline-icon to expand minor-mode list
- =breadcrumb-local-mode= shows imenu/project crumbs in the header
  line (auto-on in prog-/text-mode)


* Configuration
** About this file
:PROPERTIES:
:CUSTOM_ID: babel-init
:END:
<<babel-init>>

I decided to re-set my .emacs file after ~13 years. I'm trying to
follow the basic model of http://sachachua.com/dotemacs.

From Sacha:

If you're new to Emacs Lisp, you probably don't want to copy and paste
large chunks of this code. Instead, copy small parts of it (always
making sure to copy a complete set of parentheses) into your
=*scratch*= buffer or some other buffer in =emacs-lisp-mode=. Use =M-x
eval-buffer= to evaluate the code and see if you like the way that
Emacs behaves. See [[https://www.gnu.org/software/emacs/manual/html_mono/eintr.html][An Introduction to Programming in Emacs Lisp]] for
more details on Emacs Lisp. You can also find the manual by using =C-h
i= (=info=) and choosing "Emacs Lisp Intro".

I've installed a lot of packages. See the [[*Add%20package%20sources][package sources]] section to
add the repositories to your configuration. When you see =use-package=
and a package name you might like, you can use =M-x package-install=
to install the package of that name. Note that use-package is itself
provided by a package, so you'll probably want to install that and
=bind-key=.

If you're viewing the Org file, you can open source code blocks (those
are the ones in begin_src) in a separate buffer by moving your point
inside them and typing C-c ' (=org-edit-special=). This opens another
buffer in =emacs-lisp-mode=, so you can use =M-x eval-buffer= to load
the changes. If you want to explore how functions work, use =M-x
edebug-defun= to set up debugging for that function, and then call it.
You can learn more about edebug in the [[http://www.gnu.org/software/emacs/manual/html_node/elisp/Edebug.html][Emacs Lisp]] manual.

I like using =(setq ...)= more than Customize because I can neatly
organize my configuration that way. Ditto for =use-package= - I mostly
use it to group together package-related config without lots of
=with-eval-after-load= calls, and it also makes declaring keybindings
easier.

=~/.emacs.d/init.el= is tangled directly from this file via
=org-babel-tangle= (=C-c C-v t=). See the auto-tangle hook below.

