.emacs.d/jds-config.org
** Starting up

First line of the tangled =init.el= must declare lexical binding so
closures (lambdas in process sentinels, hooks, etc.) capture their
enclosing locals. Then load =early-init.el= for Emacs <27 (no-op on
modern Emacs since early-init runs on its own).

#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
(require 'early-init (expand-file-name "early-init" user-emacs-directory))
#+end_src

Auto-tangle this file on save so I never have to remember =C-c C-v t=.

#+begin_src emacs-lisp
  (defun jds/tangle-jds-config-on-save ()
    "Tangle `jds-config.org' when it is saved."
    (when (equal (buffer-file-name)
                 (expand-file-name "jds-config.org" user-emacs-directory))
      (let ((org-confirm-babel-evaluate nil)
            (prog-mode-hook nil))
        (org-babel-tangle))))

  (add-hook 'after-save-hook #'jds/tangle-jds-config-on-save)
#+end_src

Tip-of-the-day from the =* Cheatsheet= section above. On every Emacs
startup, =jds/tip= parses the bullets in =* Cheatsheet=, picks one at
random, and pops a small =*emacs-tip*= window. Use =M-x jds/tip= any
time to draw another. Hit =q= to dismiss the window.

This is gamification by way of your own notes: every tip is something
your config already supports, drawn from a section you maintain.

#+begin_src emacs-lisp
  (defvar jds/cheatsheet-file
    (expand-file-name "jds-config.org" user-emacs-directory)
    "Source file for `jds/tip'; expects a top-level `* Cheatsheet' heading.")

  (defun jds/cheatsheet-bullets ()
    "Return bulleted items from the `* Cheatsheet' section as strings.
  Multi-line bullets are joined with spaces; sub-bullets are folded
  into their parent. Returns nil if the section can't be found."
    (when (file-readable-p jds/cheatsheet-file)
      (with-temp-buffer
        (insert-file-contents jds/cheatsheet-file)
        (goto-char (point-min))
        (when (re-search-forward "^\\* Cheatsheet" nil t)
          (let (bullets current)
            (cl-flet ((flush ()
                        (when current
                          (push (mapconcat #'identity
                                           (nreverse current) " ")
                                bullets)
                          (setq current nil))))
              (forward-line 1)
              (catch 'done
                (while (not (eobp))
                  (let ((line (buffer-substring-no-properties
                               (line-beginning-position)
                               (line-end-position))))
                    (cond
                     ((string-match "\\`\\* " line)   ; next top-level
                      (flush) (throw 'done nil))
                     ((string-match "\\`- " line)     ; new bullet
                      (flush)
                      (setq current (list (substring line 2))))
                     ((and current (string-match "\\`[ \t]" line))
                      (push (string-trim line) current))
                     ((string-empty-p (string-trim line))
                      (flush))
                     (t (flush))))
                  (forward-line 1))
                (flush)))
            (nreverse bullets))))))

  (defun jds/tip ()
    "Show a random tip drawn from the `* Cheatsheet' section."
    (interactive)
    (let ((bullets (jds/cheatsheet-bullets)))
      (if (null bullets)
          (message "jds/tip: no cheatsheet bullets found in %s"
                   jds/cheatsheet-file)
        (let ((tip (nth (random (length bullets)) bullets)))
          (with-current-buffer (get-buffer-create "*emacs-tip*")
            (let ((inhibit-read-only t))
              (erase-buffer)
              (when (fboundp 'org-mode) (org-mode))
              (insert "* Try this\n\n")
              (insert "- " tip "\n\n")
              (insert (format "/=M-x jds/tip= for another — %d tips total/\n"
                              (length bullets)))
              (goto-char (point-min))
              (read-only-mode 1))
            (display-buffer (current-buffer)
                            '((display-buffer-pop-up-window)
                              (window-height . 14))))))))

  ;; Show a tip on startup, briefly after Emacs is idle so it doesn't
  ;; race the startup sequence.
  (add-hook 'emacs-startup-hook
            (lambda ()
              (run-with-idle-timer 2 nil #'jds/tip)))
#+end_src

#+BEGIN_SRC emacs-lisp
  (straight-use-package 'use-package)
#+END_SRC


#+BEGIN_SRC emacs-lisp
  (require 'server)
  (unless (server-running-p)
    (server-start))
#+END_SRC

** Personal information

Who I am

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Jason Sewall"
        user-mail-address "jasewall@nvidia.com")
#+END_SRC

Where I live

#+begin_src emacs-lisp
  (setq calendar-location-name "Pemaquid, ME")
#+end_src

Time zone

#+begin_src emacs-lisp
  (setq calendar-time-zone (* 60 5)
        calendar-standard-time-zone-name "EST"
        calendar-daylight-time-zone-name "EDT")
#+end_src

** Emacs initialization

*** Built-in defaults

One consolidated =(use-package emacs ...)= block for the
plain-old-settings that don't belong to a specific package: backups,
indentation, diffs, encoding, etc. Modes and per-package settings
stay in their own sections below.

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :straight (:type built-in)
    :init
    (setq use-package-verbose t
          load-prefer-newer t
          inhibit-startup-message t
          ;; Backups
          backup-directory-alist '(("." . "~/.emacs.d/backups"))
          delete-old-versions -1
          version-control t
          vc-make-backup-files t
          auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t))
          ;; Uniquify
          uniquify-buffer-name-style 'reverse
          uniquify-after-kill-buffer-p t
          ;; Editing
          sentence-end-double-space t
          require-final-newline t
          read-quoted-char-radix 16
          ;; Diffs
          diff-switches "-u"
          vc-diff-switches '("-b" "-B" "-u")
          vc-git-diff-switches nil
          vc-follow-symlinks t
          ;; Font lock
          font-lock-maximum-decoration t)
    (setq-default tab-width 2
                  indent-tabs-mode nil)
    :config
    (column-number-mode 1)
    (display-time-mode 1)
    (show-paren-mode 1)
    (global-font-lock-mode 1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    (repeat-mode 1)
    (tab-bar-mode 1)
    (when (fboundp 'pixel-scroll-precision-mode)
      (pixel-scroll-precision-mode 1))
    (fset 'yes-or-no-p 'y-or-n-p))
#+END_SRC

**** macOS modifier mapping

On macOS, remap both Command (⌘) and Option (⌥) to Meta. Don't care
about preserving Super — never use it. We set both =ns-*= (vanilla
GNU Emacs on macOS) and =mac-*= (the Yamamoto =mac= port) so this
works regardless of which build is installed.

Trade-off: Option no longer produces accented characters (⌥-a → å).
If you ever need them, switch to one of:

- =M-x insert-char RET= and pick by Unicode name (vertico-friendly)
- =C-x 8 RET= prefix for common diacritics

#+BEGIN_SRC emacs-lisp
  (when (eq system-type 'darwin)
    (setq ns-command-modifier  'meta
          mac-command-modifier 'meta
          ns-option-modifier   'meta
          mac-option-modifier  'meta))
#+END_SRC

**** Inherit shell PATH (macOS GUI, Linux GUI, daemon mode)

Any time Emacs is launched outside a login shell — Finder/Dock on
macOS, GNOME/KDE/Sway launchers on Linux, =emacs --daemon=, systemd
units — it inherits a minimal PATH that misses =/opt/homebrew/bin=,
=~/.local/bin=, =~/.cargo/bin=, etc. =exec-path-from-shell= runs
your login shell once and copies its environment in. Fixes
=executable-find= for basedpyright, ruff, taplo, pandoc, anything
installed by =uv tool=, =pipx=, =cargo install=, =npm -g=, your
distro's user-bin location.

Window system check covers macOS (=ns=, =mac=), X11 (=x=), Wayland
(=pgtk= and =pure-gtk= when Emacs is built with =--with-pgtk=), and
daemon launches where =window-system= is nil at init time.

#+BEGIN_SRC emacs-lisp
  (use-package exec-path-from-shell
    :straight t
    :if (or (memq window-system '(mac ns x pgtk pure-gtk))
            (daemonp))
    :config
    (dolist (var '("PATH"
                   "MANPATH"
                   "GITHUB_TOKEN"))
      (add-to-list 'exec-path-from-shell-variables var))
    (exec-path-from-shell-initialize))
#+END_SRC

** General configuration
*** Fonts
(set-frame-font "Hack" nil t)
*** Hydra
Keybinding craziness
#+begin_src emacs-lisp
  (use-package hydra
  :straight t)
#+end_src
*** Flymake
Built-in syntax checker. Eglot turns this on automatically in LSP
buffers; we also enable it in prog-mode for non-LSP buffers (elisp,
etc.).

By default flymake only shows the diagnostic message when point is
inside the underlined region. That's annoying when there's a margin
=!= and you've already moved to the line — you shouldn't have to
hunt for the exact column. We override the eldoc integration with a
line-aware variant and add =C-c != to echo any diagnostics on the
current line on demand.

#+BEGIN_SRC emacs-lisp
  (defun jds/flymake-eldoc-on-line (report-doc &rest _)
    "Like `flymake-eldoc-function' but for the whole current line.
  Returns a string suitable for eldoc when there is at least one
  flymake diagnostic anywhere between =line-beginning-position= and
  =line-end-position=."
    (let ((diags (flymake-diagnostics
                  (line-beginning-position) (line-end-position))))
      (when diags
        (funcall report-doc
                 (mapconcat
                  (lambda (d)
                    (format "[%s] %s"
                            (flymake-diagnostic-type d)
                            (flymake-diagnostic-text d)))
                  diags "\n")))))

  (defun jds/flymake-line-message ()
    "Echo flymake diagnostics for the current line, if any."
    (interactive)
    (let ((diags (flymake-diagnostics
                  (line-beginning-position) (line-end-position))))
      (if diags
          (message "%s"
                   (mapconcat
                    (lambda (d)
                      (format "[%s] %s"
                              (flymake-diagnostic-type d)
                              (flymake-diagnostic-text d)))
                    diags "\n"))
        (message "No flymake diagnostics on this line"))))

  (defun jds/setup-flymake-eldoc ()
    "Swap flymake's point-only eldoc reporter for a line-aware one."
    (remove-hook 'eldoc-documentation-functions
                 #'flymake-eldoc-function t)
    (add-hook 'eldoc-documentation-functions
              #'jds/flymake-eldoc-on-line nil t))

  (use-package flymake
    :straight (:type built-in)
    :hook ((prog-mode . flymake-mode)
           (flymake-mode . jds/setup-flymake-eldoc))
    :bind (:map flymake-mode-map
           ("M-n" . flymake-goto-next-error)
           ("M-p" . flymake-goto-prev-error)
           ("C-c ! l" . flymake-show-buffer-diagnostics)
           ("C-c !"   . jds/flymake-line-message)))
#+END_SRC

*** Key-chord
#+BEGIN_SRC emacs-lisp
  (use-package key-chord
    :straight t
    :init (key-chord-mode 1))
#+END_SRC

*** Libraries

#+begin_src emacs-lisp
  (use-package dash
    :straight t)
#+end_src

*** History
Savehist persists minibuffer/kill-ring history across sessions.
#+BEGIN_SRC emacs-lisp
  (setq savehist-file "~/.emacs.d/savehist"
        history-length t
        history-delete-duplicates t
        savehist-save-minibuffer-history 1
        savehist-additional-variables
        '(kill-ring search-ring regexp-search-ring))
  (savehist-mode 1)
#+END_SRC
*** Desktop

Save sesions

#+BEGIN_SRC emacs-lisp
  (desktop-save-mode 1)
  (setq desktop-restore-eager 10)
#+END_SRC

Handy hydra for desktop

#+begin_src emacs-lisp
  (defhydra hydra-desktop (:color blue)
    "desktop"
    ("c" desktop-clear "clear")
    ("s" desktop-save "save")
    ("r" desktop-revert "revert")
    ("d" desktop-change-dir "dir"))
#+end_src

*** Windows configuration

Don't let butterfingers kill it

#+BEGIN_SRC emacs-lisp
  (when window-system
    (global-unset-key "\C-z"))
  (when window-system
    (global-unset-key "\C-x\C-z"))
#+END_SRC

Make it harder to accidentally quit

#+BEGIN_SRC emacs-lisp
  (global-unset-key "\C-x\C-c")
  (global-set-key "\C-x\C-c\C-v" 'save-buffers-kill-emacs)
#+END_SRC

Helpful names

#+BEGIN_SRC emacs-lisp
  (setq frame-title-format
        (concat  "emacs@" (system-name)))
  (unless window-system
    (send-string-to-terminal (concat "\ek" frame-title-format "\e\\")))
#+END_SRC

