.emacs.d/init.el
(require 'early-init (expand-file-name "early-init" user-emacs-directory))

(defun jds/tangle-jds-config-on-save ()
  "Tangle `jds-config.org' when it is saved."
  (when (equal (buffer-file-name)
               (expand-file-name "jds-config.org" user-emacs-directory))
    (let ((org-confirm-babel-evaluate nil)
          (prog-mode-hook nil))
      (org-babel-tangle))))

(add-hook 'after-save-hook #'jds/tangle-jds-config-on-save)

(straight-use-package 'use-package)

(require 'server)
(unless (server-running-p)
  (server-start))

(setq user-full-name "Jason Sewall"
      user-mail-address "jasewall@nvidia.com")

(setq calendar-location-name "Pemaquid, ME")

(setq calendar-time-zone (* 60 5)
      calendar-standard-time-zone-name "EST"
      calendar-daylight-time-zone-name "EDT")

(use-package emacs
  :straight (:type built-in)
  :init
  (setq use-package-verbose t
        load-prefer-newer t
        inhibit-startup-message t
        ;; Backups
        backup-directory-alist '(("." . "~/.emacs.d/backups"))
        delete-old-versions -1
        version-control t
        vc-make-backup-files t
        auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t))
        ;; Uniquify
        uniquify-buffer-name-style 'reverse
        uniquify-after-kill-buffer-p t
        ;; Editing
        sentence-end-double-space t
        require-final-newline t
        read-quoted-char-radix 16
        ;; Diffs
        diff-switches "-u"
        vc-diff-switches '("-b" "-B" "-u")
        vc-git-diff-switches nil
        vc-follow-symlinks t
        ;; Font lock
        font-lock-maximum-decoration t)
  (setq-default tab-width 2
                indent-tabs-mode nil)
  :config
  (column-number-mode 1)
  (display-time-mode 1)
  (show-paren-mode 1)
  (global-font-lock-mode 1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (repeat-mode 1)
  (tab-bar-mode 1)
  (when (fboundp 'pixel-scroll-precision-mode)
    (pixel-scroll-precision-mode 1))
  (fset 'yes-or-no-p 'y-or-n-p))

(use-package hydra
:straight t)

(use-package flymake
  :straight (:type built-in)
  :hook (prog-mode . flymake-mode)
  :bind (:map flymake-mode-map
         ("M-n" . flymake-goto-next-error)
         ("M-p" . flymake-goto-prev-error)
         ("C-c ! l" . flymake-show-buffer-diagnostics)))

(use-package key-chord
  :straight t
  :init (key-chord-mode 1))

(use-package dash
  :straight t)

(setq savehist-file "~/.emacs.d/savehist"
      history-length t
      history-delete-duplicates t
      savehist-save-minibuffer-history 1
      savehist-additional-variables
      '(kill-ring search-ring regexp-search-ring))
(savehist-mode 1)

(desktop-save-mode 1)
(setq desktop-restore-eager 10)

(defhydra hydra-desktop (:color blue)
  "desktop"
  ("c" desktop-clear "clear")
  ("s" desktop-save "save")
  ("r" desktop-revert "revert")
  ("d" desktop-change-dir "dir"))

(when window-system
  (global-unset-key "\C-z"))
(when window-system
  (global-unset-key "\C-x\C-z"))

(global-unset-key "\C-x\C-c")
(global-set-key "\C-x\C-c\C-v" 'save-buffers-kill-emacs)

(setq frame-title-format
      (concat  "emacs@" (system-name)))
(unless window-system
  (send-string-to-terminal (concat "\ek" frame-title-format "\e\\")))
