.emacs.d/jds-config.org
**** Winner

#+begin_src emacs-lisp
  (use-package ace-window
    :straight t)
  (defhydra hydra-window (global-map "C-x w")
    "
  Movement^^        ^Split^         ^Switch^      ^Resize^
  ----------------------------------------------------------------
  _h_ ←         _v_ertical      _b_uffer        _q_ X←
  _j_ ↓         _x_ horizontal  _f_ind files    _w_ X↓
  _k_ ↑         _z_ undo        _a_ce 1     _e_ X↑
  _l_ →         _Z_ reset       _s_wap      _r_ X→
  _F_ollow        _D_lt Other     _S_ave      max_i_mize
  _SPC_ cancel    _o_nly this     _d_elete
  "
    ("h" windmove-left )
    ("j" windmove-down )
    ("k" windmove-up )
    ("l" windmove-right )
    ("q" hydra-move-splitter-left)
    ("w" hydra-move-splitter-down)
    ("e" hydra-move-splitter-up)
    ("r" hydra-move-splitter-right)
    ("F" follow-mode)
    ("a" (lambda ()
	   (interactive)
	   (ace-window 1)
	   (add-hook 'ace-window-end-once-hook
		     'hydra-window/body))
     )
    ("v" (lambda ()
	   (interactive)
	   (split-window-right)
	   (windmove-right))
     )
    ("x" (lambda ()
	   (interactive)
	   (split-window-below)
	   (windmove-down))
     )
    ("s" (lambda ()
	   (interactive)
	   (ace-window 4)
	   (add-hook 'ace-window-end-once-hook
		     'hydra-window/body)))
    ("S" save-buffer)
    ("d" delete-window)
    ("D" (lambda ()
	   (interactive)
	   (ace-window 16)
	   (add-hook 'ace-window-end-once-hook
		     'hydra-window/body))
     )
    ("b" switch-to-buffer :exit t)
    ("f" find-file :exit t)
    ("o" delete-other-windows)
    ("i" ace-maximize-window)
    ("z" (progn
	   (winner-undo)
	   (setq this-command 'winner-undo))
     )
    ("Z" winner-redo)
    ("SPC" nil))
#+end_src

