.emacs.d/jds-config.org
*** Appearances

Prot's ef-themes — pleasant, well-balanced, many variants. Try
=M-x ef-themes-select= to browse, or =M-x ef-themes-toggle= to
switch between a preferred light/dark pair.

#+BEGIN_SRC emacs-lisp
  (use-package ef-themes
    :straight t
    :config
    (setq ef-themes-to-toggle '(ef-dream ef-frost))
    (load-theme 'ef-dream :no-confirm))
#+END_SRC

=minions= collapses the long list of minor-mode lighters in the
modeline into a single icon you can click to expand.

#+BEGIN_SRC emacs-lisp
  (use-package minions
    :straight t
    :config (minions-mode 1))
#+END_SRC

=breadcrumb= shows your location (imenu / project) in the header
line. Helpful when navigating big files.

#+BEGIN_SRC emacs-lisp
  (use-package breadcrumb
    :straight t
    :hook ((prog-mode . breadcrumb-local-mode)
           (text-mode . breadcrumb-local-mode)))
#+END_SRC

*** Unicode

#+BEGIN_SRC emacs-lisp
  (prefer-coding-system 'utf-8)
  (setq-default buffer-file-coding-system 'utf-8-unix)
  (set-default-coding-systems 'utf-8-unix)
  (setq-default default-buffer-file-coding-system 'utf-8-unix)
  (define-coding-system-alias 'UTF-8 'utf-8)

  (defmacro my/insert-unicode (unicode-name)
    `(lambda () (interactive)
       (insert-char (cdr (assoc-string ,unicode-name (ucs-names))))))

  (when (display-graphic-p)
    (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
#+END_SRC

*** Expand

#+BEGIN_SRC emacs-lisp
  (bind-key "M-/" 'hippie-expand)
#+END_SRC

From https://github.com/purcell/emacs.d/blob/master/lisp/init-auto-complete.el - Exclude very large buffers from dabbrev
#+BEGIN_SRC emacs-lisp
  (defun sanityinc/dabbrev-friend-buffer (other-buffer)
    (< (buffer-size other-buffer) (* 1 1024 1024)))
  (setq dabbrev-friend-buffer-function 'sanityinc/dabbrev-friend-buffer)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (setq hippie-expand-try-functions-list
        '(try-expand-all-abbrevs
          try-complete-file-name-partially
          try-complete-file-name
          try-expand-dabbrev
          try-expand-dabbrev-from-kill
          try-expand-dabbrev-all-buffers
          try-expand-list
          try-expand-line
          try-complete-lisp-symbol-partially
          try-complete-lisp-symbol))
#+END_SRC

*** Diminish

#+BEGIN_SRC emacs-lisp
  (use-package diminish
    :straight t
    :init (diminish 'eldoc-mode))
#+END_SRC

*** Eglot

#+BEGIN_SRC emacs-lisp
  (use-package eglot
    :straight (:type built-in)
    :config
    (add-to-list 'eglot-server-programs
                 '(c-mode c++-mode cuda-mode
                          . ("clangd"
                             "-j=4"
                             "--malloc-trim"
                             "--log=error"
                             "--background-index"
                             "--clang-tidy"
                             "--cross-file-rename"
                             "--completion-style=detailed"
                             "--pch-storage=memory"
                             "--header-insertion=never"
                             "--header-insertion-decorators=0")))
    ;; basedpyright for type-aware completion, hover docs, and rename.
    ;; Ruff is handled separately by apheleia (format) and could also
    ;; be run as a flymake lint via flymake-ruff if you wanted, but
    ;; basedpyright's diagnostics + mypy + ty already cover lots.
    (add-to-list 'eglot-server-programs
                 '(python-ts-mode . ("basedpyright-langserver" "--stdio"))))

#+END_SRC

*** Tree-sitter

=treesit= is built into Emacs 29+. =treesit-auto= auto-installs
grammars and remaps modes to their =-ts-mode= variants (so
=python-mode= → =python-ts-mode=, =rust-mode= → =rust-ts-mode=, etc.).

#+BEGIN_SRC emacs-lisp
  (use-package treesit-auto
    :straight t
    :custom
    (treesit-auto-install 'prompt)
    :config
    (treesit-auto-add-to-auto-mode-alist 'all)
    (global-treesit-auto-mode))
#+END_SRC

*** eldoc-box — floating signature/doc popups

The default eldoc echo area is cramped for LSP-style signatures.
=eldoc-box= pops a child frame instead. Toggle with =C-h .= or hover.

#+BEGIN_SRC emacs-lisp
  (use-package eldoc-box
    :straight t
    :hook (eglot-managed-mode . eldoc-box-hover-mode)
    :custom
    (eldoc-box-max-pixel-width 600)
    (eldoc-box-max-pixel-height 400))
#+END_SRC

** System stuff
*** Tramp
Real handy when working on remote machines
#+begin_src emacs-lisp
  (use-package tramp
    :straight (:type built-in)
    :init (setq tramp-unified-filename t))
#+end_src
*** Shells
**** Remote term access

This lets me open up terminals. I wish I could get this to work with tramp.

#+begin_src emacs-lisp
  (add-hook 'term-mode-hook
      (lambda ()
        (setq term-buffer-maximum-size 100000)))

  ;; Use this for remote so I can specify command line arguments
  (defun my/remote-term (new-buffer-name cmd &rest switches)
    (setq term-ansi-buffer-name (concat "*" new-buffer-name "*"))
    (setq term-ansi-buffer-name (generate-new-buffer-name term-ansi-buffer-name))
    (setq term-ansi-buffer-name (apply 'make-term term-ansi-buffer-name cmd nil switches))
    (set-buffer term-ansi-buffer-name)
    (term-mode)
    (term-char-mode)
    (let (term-escape-char)
      ;; I wanna have find-file on C-x C-f -mm
      ;; your mileage may definitely vary, maybe it's better to put this in your
      ;; .emacs ...
      (term-set-escape-char ?\C-x))

    (switch-to-buffer term-ansi-buffer-name))

  (use-package pcomplete
    :straight (:type built-in)
    :init (progn (require 'pcmpl-unix) (defun my/ssh-remote-term (hostname)
                                         (interactive (list (completing-read "Hostname: " (pcmpl-ssh-hosts))))
                                         (my/remote-term hostname "ssh" hostname))))

  ;; (defun helm-source-ssh-remote-term ()
  ;;   (helm-build-sync-source "SSH hostname"
  ;;     :candidates (lambda () (pcmpl-ssh-hosts))
  ;;     :filtered-candidate-transformer '(helm-adaptive-sort)
  ;;     :nomark t
  ;;     :action '(("Select host" . my/ssh-remote-term))))

  ;; (defun my/helm-ssh-remote-term ()
  ;;   (interactive)
  ;;   (helm :sources (helm-source-ssh-remote-term)
  ;;         :buffer "*helm-ssh-remote-term*"))

  (defun my/local-term ()
    (interactive)
    (ansi-term "bash" "localhost"))
#+end_src

**** Eat
#+begin_src emacs-lisp
(straight-use-package
 '(eat :type git
       :host codeberg
       :repo "akib/emacs-eat"
       :files ("*.el" ("term" "term/*.el") "*.texi"
               "*.ti" ("terminfo/e" "terminfo/e/*")
               ("terminfo/65" "terminfo/65/*")
               ("integration" "integration/*")
               (:exclude ".dir-locals.el" "*-tests.el"))))
#+end_src
**** Customize shells
#+begin_src emacs-lisp
  (add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
  (add-hook 'comint-output-filter-functions 'comint-watch-for-password-prompt)
#+end_src
*** Ibuffer
#+begin_src emacs-lisp
  (use-package ibuffer
    :straight (:type built-in)
    :bind (("<f9>" . ibuffer))
    :init (setq ibuffer-shrink-to-minimum-size t
                ibuffer-always-show-last-buffer nil
                ibuffer-sorting-mode 'recency
                ibuffer-use-header-line t))
#+end_src
** Projects & version control
*** Git
I don't know if this is actually necessary
#+begin_src emacs-lisp
  (add-to-list 'vc-handled-backends 'GIT)
#+end_src
*** Git-link
#+begin_src emacs-lisp
  (use-package git-link
    :straight t
    :init (global-set-key (kbd "C-c m l") 'git-link))
#+end_src
*** YADM
#+begin_src emacs-lisp
  (add-to-list 'tramp-methods
               '("yadm"
                 (tramp-login-program "yadm")
                 (tramp-login-args (("enter")))
                 (tramp-remote-shell "/bin/sh")
                 (tramp-remote-shell-args ("-c"))))
#+end_src
*** Magit
#+begin_src emacs-lisp
  (use-package magit
    :straight t
    :init (setq magit-auto-revert-mode t)
    :bind (("C-x C-g" . magit-status)))
#+end_src
*** Projects
Use the built-in =project.el=. Standard prefix is =C-x p= (e.g. =C-x p
f= find file in project, =C-x p g= grep, =C-x p p= switch project).
=consult-buffer= and =magit= integrate with this natively.
#+begin_src emacs-lisp
  (use-package project
    :straight (:type built-in))
#+end_src
** Navigation & Search
*** Go to line
#+begin_src emacs-lisp
  (global-set-key "\C-cg" 'goto-line)

  (use-package avy
    :straight t
    :init (defhydra hydra-avy (global-map "M-g" :color blue)
	    "avy-goto"
	    ("c" avy-goto-char "char")
	    ("C" avy-goto-char-2 "char-2")
	    ("w" avy-goto-word-1 "word")
	    ("s" avy-goto-subword-1 "subword")
	    ("u" link-hint-open-link "open-URI")
	    ("U" link-hint-copy-link "copy-URI"))
    :bind (("M-g g" . avy-goto-line)))

  (defhydra hydra-goto-line (goto-map ""
				      :pre (display-line-numbers-mode 1)
				      :post (display-line-numbers-mode -1))
    "goto-line"
    ("g" goto-line "go")
    ("m" set-mark-command "mark" :bind nil)
    ("q" nil "quit"))
#+end_src
*** Menu bar via keyboard
Navigate menus via keyboard using consult.
#+begin_src emacs-lisp
  (global-set-key (kbd "<f10>") #'consult-menu-bar)
#+end_src

*** Window movement
Use arrow keys to switch windows.
#+begin_src emacs-lisp
  (use-package windmove
    :straight (:type built-in)
    :init (windmove-default-keybindings))
  (global-set-key "\M-o" 'other-window)
#+end_src
