.emacs.d/init.el

(use-package ef-themes
  :straight t
  :config
  (setq ef-themes-to-toggle '(ef-dream ef-frost))
  (load-theme 'ef-dream :no-confirm))

(use-package minions
  :straight t
  :config (minions-mode 1))

(use-package breadcrumb
  :straight t
  :hook ((prog-mode . breadcrumb-local-mode)
         (text-mode . breadcrumb-local-mode)))

(prefer-coding-system 'utf-8)
(setq-default buffer-file-coding-system 'utf-8-unix)
(set-default-coding-systems 'utf-8-unix)
(setq-default default-buffer-file-coding-system 'utf-8-unix)
(define-coding-system-alias 'UTF-8 'utf-8)

(defmacro my/insert-unicode (unicode-name)
  `(lambda () (interactive)
     (insert-char (cdr (assoc-string ,unicode-name (ucs-names))))))

(when (display-graphic-p)
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))

(bind-key "M-/" 'hippie-expand)

(defun sanityinc/dabbrev-friend-buffer (other-buffer)
  (< (buffer-size other-buffer) (* 1 1024 1024)))
(setq dabbrev-friend-buffer-function 'sanityinc/dabbrev-friend-buffer)

(setq hippie-expand-try-functions-list
      '(try-expand-all-abbrevs
        try-complete-file-name-partially
        try-complete-file-name
        try-expand-dabbrev
        try-expand-dabbrev-from-kill
        try-expand-dabbrev-all-buffers
        try-expand-list
        try-expand-line
        try-complete-lisp-symbol-partially
        try-complete-lisp-symbol))

(use-package diminish
  :straight t
  :init (diminish 'eldoc-mode))

(use-package eglot
  :straight (:type built-in)
  :config
  (add-to-list 'eglot-server-programs
               '(c-mode c++-mode cuda-mode
                        . ("clangd"
                           "-j=4"
                           "--malloc-trim"
                           "--log=error"
                           "--background-index"
                           "--clang-tidy"
                           "--cross-file-rename"
                           "--completion-style=detailed"
                           "--pch-storage=memory"
                           "--header-insertion=never"
                           "--header-insertion-decorators=0")))
  ;; basedpyright for type-aware completion, hover docs, and rename.
  ;; Ruff is handled separately by apheleia (format) and could also
  ;; be run as a flymake lint via flymake-ruff if you wanted, but
  ;; basedpyright's diagnostics + mypy + ty already cover lots.
  (add-to-list 'eglot-server-programs
               '(python-ts-mode . ("basedpyright-langserver" "--stdio"))))


(use-package treesit-auto
  :straight t
  :custom
  (treesit-auto-install 'prompt)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))

(use-package eldoc-box
  :straight t
  :hook (eglot-managed-mode . eldoc-box-hover-mode)
  :custom
  (eldoc-box-max-pixel-width 600)
  (eldoc-box-max-pixel-height 400))

(use-package tramp
  :straight (:type built-in)
  :init (setq tramp-unified-filename t))

(add-hook 'term-mode-hook
    (lambda ()
      (setq term-buffer-maximum-size 100000)))

;; Use this for remote so I can specify command line arguments
(defun my/remote-term (new-buffer-name cmd &rest switches)
  (setq term-ansi-buffer-name (concat "*" new-buffer-name "*"))
  (setq term-ansi-buffer-name (generate-new-buffer-name term-ansi-buffer-name))
  (setq term-ansi-buffer-name (apply 'make-term term-ansi-buffer-name cmd nil switches))
  (set-buffer term-ansi-buffer-name)
  (term-mode)
  (term-char-mode)
  (let (term-escape-char)
    ;; I wanna have find-file on C-x C-f -mm
    ;; your mileage may definitely vary, maybe it's better to put this in your
    ;; .emacs ...
    (term-set-escape-char ?\C-x))

  (switch-to-buffer term-ansi-buffer-name))

(use-package pcomplete
  :straight (:type built-in)
  :init (progn (require 'pcmpl-unix) (defun my/ssh-remote-term (hostname)
                                       (interactive (list (completing-read "Hostname: " (pcmpl-ssh-hosts))))
                                       (my/remote-term hostname "ssh" hostname))))

;; (defun helm-source-ssh-remote-term ()
;;   (helm-build-sync-source "SSH hostname"
;;     :candidates (lambda () (pcmpl-ssh-hosts))
;;     :filtered-candidate-transformer '(helm-adaptive-sort)
;;     :nomark t
;;     :action '(("Select host" . my/ssh-remote-term))))

;; (defun my/helm-ssh-remote-term ()
;;   (interactive)
;;   (helm :sources (helm-source-ssh-remote-term)
;;         :buffer "*helm-ssh-remote-term*"))

(defun my/local-term ()
  (interactive)
  (ansi-term "bash" "localhost"))

(straight-use-package
 '(eat :type git
       :host codeberg
       :repo "akib/emacs-eat"
       :files ("*.el" ("term" "term/*.el") "*.texi"
               "*.ti" ("terminfo/e" "terminfo/e/*")
               ("terminfo/65" "terminfo/65/*")
               ("integration" "integration/*")
               (:exclude ".dir-locals.el" "*-tests.el"))))

(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
(add-hook 'comint-output-filter-functions 'comint-watch-for-password-prompt)

(use-package ibuffer
  :straight (:type built-in)
  :bind (("<f9>" . ibuffer))
  :init (setq ibuffer-shrink-to-minimum-size t
              ibuffer-always-show-last-buffer nil
              ibuffer-sorting-mode 'recency
              ibuffer-use-header-line t))

(add-to-list 'vc-handled-backends 'GIT)

(use-package git-link
  :straight t
  :init (global-set-key (kbd "C-c m l") 'git-link))

(add-to-list 'tramp-methods
             '("yadm"
               (tramp-login-program "yadm")
               (tramp-login-args (("enter")))
               (tramp-remote-shell "/bin/sh")
               (tramp-remote-shell-args ("-c"))))

(use-package magit
  :straight t
  :init (setq magit-auto-revert-mode t)
  :bind (("C-x C-g" . magit-status)))

(use-package project
  :straight (:type built-in))

(global-set-key "\C-cg" 'goto-line)

(use-package avy
  :straight t
  :init (defhydra hydra-avy (global-map "M-g" :color blue)
    "avy-goto"
    ("c" avy-goto-char "char")
    ("C" avy-goto-char-2 "char-2")
    ("w" avy-goto-word-1 "word")
    ("s" avy-goto-subword-1 "subword")
    ("u" link-hint-open-link "open-URI")
    ("U" link-hint-copy-link "copy-URI"))
  :bind (("M-g g" . avy-goto-line)))

(defhydra hydra-goto-line (goto-map ""
			      :pre (display-line-numbers-mode 1)
			      :post (display-line-numbers-mode -1))
  "goto-line"
  ("g" goto-line "go")
  ("m" set-mark-command "mark" :bind nil)
  ("q" nil "quit"))

(global-set-key (kbd "<f10>") #'consult-menu-bar)

(use-package windmove
  :straight (:type built-in)
  :init (windmove-default-keybindings))
(global-set-key "\M-o" 'other-window)
