.emacs.d/init.el

(defun my/smarter-move-beginning-of-line (arg)
  "Move point back to indentation of beginning of line.

Move point to the first non-whitespace character on this line.
If point is already there, move to the beginning of the line.
Effectively toggle between the first non-whitespace character and
the beginning of the line.

If ARG is not nil or 1, move forward ARG - 1 lines first.  If
point reaches the beginning or end of the buffer, stop there."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))

;; remap C-a to `smarter-move-beginning-of-line'
(global-set-key [remap move-beginning-of-line]
                'my/smarter-move-beginning-of-line)

(use-package rg
  :straight t
  :init (rg-enable-default-bindings))

(use-package phi-search
  :straight t
  :diminish phi-search
  :after multiple-cursors
  :bind (:map mc/keymap
         ("C-s" . phi-search)
         ("C-r" . phi-search-backward)))

(use-package yasnippet
  :straight t
  :init (yas-global-mode 1))

(use-package which-key
  :straight t
  :init (which-key-mode))

(use-package aggressive-indent
  :straight t)

(use-package multiple-cursors
  :straight t
  :init (defhydra multiple-cursors-hydra (global-map "C-x m")
    "
     ^Up^            ^Down^        ^Other^
----------------------------------------------
[_p_]   Next    [_n_]   Next    [_l_] Edit lines
[_P_]   Skip    [_N_]   Skip    [_a_] Mark all
[_M-p_] Unmark  [_M-n_] Unmark  [_r_] Mark by regep
^ ^             ^ ^             [_i_] Insert numbers
^ ^             ^ ^             [_h_] Hide unmatched
^ ^             ^ ^             [_s_] Sort regions
^ ^             ^ ^             [_q_] Quit
"
    ("i" mc/insert-numbers)
    ("h" mc-hide-unmatched-lines-mode)
    ("s" mc/sort-regions)
    ("l" mc/edit-lines :exit t)
    ("a" mc/mark-all-like-this :exit t)
    ("n" mc/mark-next-like-this)
    ("N" mc/skip-to-next-like-this)
    ("M-n" mc/unmark-next-like-this)
    ("p" mc/mark-previous-like-this)
    ("P" mc/skip-to-previous-like-this)
    ("M-p" mc/unmark-previous-like-this)
    ("r" mc/mark-all-in-region-regexp :exit t)
    ("q" nil))
  :bind (("C-^" . set-rectangular-region-anchor)
   ("M-3" . mc/mark-next-like-this)
   ("M-4" . mc/mark-previous-like-this)
   ("M-#" . mc/unmark-next-like-this)
   ("M-$" . mc/unmark-previous-like-this)))

(use-package expand-region
  :straight t
  :defer t
  :bind (("M-2" . er/expand-region)))

(defun my/forward-transpose-whitespace (begin end)
  "If mark is active, swap leading whitespace with region between
      point and mark. If mark isn't active, find the first
      non-whitespace character after point and swap it with the
      whitespace before it. To start, place point on character or at
      start of region."
  (interactive "*r")
  (let* ((string-to-be-switched
          (if (use-region-p)
              (delete-and-extract-region begin end)
            (progn
              (skip-chars-forward "[:space:]")
              (delete-and-extract-region (point) (1+ (point))))))
         (right-anchor (point))
         (whitespace
          (progn
            (skip-chars-backward "[:space:]")
            (delete-and-extract-region (point) right-anchor))))
    (insert string-to-be-switched whitespace)))

(global-set-key (kbd "C-c t") 'my/forward-transpose-whitespace)

(defun my/unfill-paragraph (&optional region)
  "Takes a multi-line paragraph and makes it into a single line of text."
  (interactive (progn
                 (barf-if-buffer-read-only)
                 (list t)))
  (let ((fill-column (point-max)))
    (fill-paragraph nil region)))
(bind-key "C-x M-q" 'my/unfill-paragraph)

(defun my/fill-or-unfill-paragraph (&optional unfill region)
  "Fill paragraph (or REGION).
  With the prefix argument UNFILL, unfill it instead."
  (interactive (progn
                 (barf-if-buffer-read-only)
                 (list (if current-prefix-arg 'unfill) t)))
  (let ((fill-column (if unfill (point-max) fill-column)))
    (fill-paragraph nil region)))
(bind-key "M-q" 'my/fill-or-unfill-paragraph)

(remove-hook 'text-mode-hook #'turn-on-auto-fill)
(add-hook 'text-mode-hook 'turn-on-visual-line-mode)

(bind-key "M-SPC" 'cycle-spacing)

(use-package ws-butler
  :straight t
  :hook (prog-mode . ws-butler-mode))

(use-package vundo
  :straight t
  :bind (("C-x u" . vundo))
  :custom
  (vundo-glyph-alist vundo-unicode-symbols))

(setq org-src-window-setup 'current-window)

(use-package org-modern
  :straight t
  :hook (org-mode . org-modern-mode))

(use-package org-appear
  :straight t
  :hook (org-mode . org-appear-mode))

(defun my/copy-code-as-org-block-and-gist (beg end)
  (interactive "r")
  (let ((filename (file-name-base))
        (mode (symbol-name major-mode))
        (contents
         (if (use-region-p) (buffer-substring beg end) (buffer-string)))
        (gist (if (use-region-p) (gist-region beg end) (gist-buffer))))
    (kill-new
     (format "\n[[%s][Gist: %s]]\n#+begin_src %s\n%s\n#+end_src\n"
             (oref (oref gist :data) :html-url) filename
             (replace-regexp-in-string "-mode$" "" mode)
             contents))))

(use-package compile
  :straight (:type built-in)
  :init (progn
    (add-hook 'c-mode-common-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
    (add-hook 'fortran-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
    (add-hook 'f90-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
    (add-hook 'makefile-gmake-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
    (add-hook 'compilation-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile))))
  (setq compilation-scroll-output 'first-error))

(defhydra hydra-next-error
  (global-map "C-x")
  "
Compilation errors:
_j_: next error        _h_: first error    _q_uit
_k_: previous error    _l_: last error
"
  ("`" next-error     nil)
  ("j" next-error     nil :bind nil)
  ("k" previous-error nil :bind nil)
  ("h" first-error    nil :bind nil)
  ("l" (condition-case err
           (while t
             (next-error))
         (user-error nil))
   nil :bind nil)
  ("q" nil            nil :color blue))

(use-package auctex
  :straight t
  :defer t
  :config (progn (setq TeX-PDF-mode t)
	   (add-hook 'LaTeX-mode-hook '(lambda () (flyspell-mode 1)))))

(use-package sly
  :straight t
  :custom
  (inferior-lisp-program "sbcl"))
