.emacs.d/init.el

(defun my/eval-and-replace ()
  "Replace the preceding sexp with its value."
  (interactive)
  (backward-kill-sexp)
  (condition-case nil
      (prin1 (eval (read (current-kill 0)))
             (current-buffer))
    (error (message "Invalid expression")
           (insert (current-kill 0)))))

(global-set-key (kbd "C-x C-e") 'my/eval-and-replace)

(use-package python
  :straight (:type built-in)
  :hook (python-ts-mode . eglot-ensure)
  :mode (("\\.py\\'" . python-ts-mode)))

;; pyvenv supplies the activation primitives that pet drives.
(use-package pyvenv
  :straight t
  :after python
  :config
  (add-to-list 'global-mode-string
               '(pyvenv-virtual-env-name (" venv:" pyvenv-virtual-env-name " "))
               'append))

;; pet (Python Environment Tool) auto-detects the right venv per
;; project — looks at .venv/, .python-version, pyproject.toml. Works
;; with uv, poetry, pipenv, rye out of the box, no per-project setup.
;; pet-mode wires its findings into pyvenv, eglot, flymake-mypy, etc.
(use-package pet
  :straight t
  :config
  (add-hook 'python-base-mode-hook #'pet-mode -10))

(defvar jds/python-required-tools
  '(("basedpyright-langserver" "basedpyright" "type-aware LSP (eglot)")
    ("ruff"                    "ruff"         "formatter & linter (apheleia)")
    ("mypy"                    "mypy"         "static type checker (flymake-mypy)")
    ("ty"                      "ty"           "Astral type checker (flymake)"))
  "List of (EXECUTABLE UV-PACKAGE DESCRIPTION) for Python tooling.")

(defvar jds/python-tools--checked nil
  "Non-nil once we've reported on missing Python tools this session.")

(defun jds/python--find-tool (exe)
  "Locate EXE, preferring the project venv via pet when available."
  (or (and (fboundp 'pet-executable-find) (pet-executable-find exe))
      (executable-find exe)))

(defun jds/python-check-tools (&optional force)
  "Report any of `jds/python-required-tools' that aren't on PATH.
With prefix arg, re-check even if already reported this session."
  (interactive "P")
  (when (or force (not jds/python-tools--checked))
    (setq jds/python-tools--checked t)
    (let (missing)
      (dolist (entry jds/python-required-tools)
        (unless (jds/python--find-tool (car entry))
          (push entry missing)))
      (cond
       (missing
        (with-current-buffer (get-buffer-create "*python-tools*")
          (let ((inhibit-read-only t))
            (erase-buffer)
            (insert "Python tools not found on PATH (or in project venv):\n\n")
            (dolist (m (nreverse missing))
              (insert (format "  • %s\n      %s\n      install: uv tool install %s\n\n"
                              (car m) (nth 2 m) (nth 1 m))))
            (insert "After installing, run M-x jds/python-check-tools to re-verify.\n")
            (insert "Or for project-local tools: uv add --dev <pkg> then uv sync.\n")
            (special-mode))
          (display-buffer (current-buffer))))
       (force
        (message "Python: all expected tools found"))))))

(add-hook 'python-base-mode-hook #'jds/python-check-tools)

(use-package apheleia
  :straight (apheleia
             :type git
             :host github
             :repo "radian-software/apheleia")
  :hook (python-ts-mode . apheleia-mode)
  :config
  ;; Use ruff format (apheleia knows ruff already; this makes sure
  ;; python-ts-mode buffers route to it).
  (setf (alist-get 'python-ts-mode apheleia-mode-alist) 'ruff))

(use-package flymake-mypy
  :straight (flymake-mypy :type git :host github :repo "com4/flymake-mypy")
  :hook (python-base-mode . flymake-mypy-enable))

(defvar-local jds/flymake-ty--proc nil)

(defun jds/flymake-ty-backend (report-fn &rest _args)
  "Flymake backend running =ty check= on the current buffer's file."
  (let ((file (buffer-file-name))
        (source (current-buffer)))
    (when (and file (executable-find "ty"))
      (when (process-live-p jds/flymake-ty--proc)
        (kill-process jds/flymake-ty--proc))
      (setq
       jds/flymake-ty--proc
       (make-process
        :name "flymake-ty" :noquery t :connection-type 'pipe
        :buffer (generate-new-buffer " *flymake-ty*")
        :command (list "ty" "check" "--output-format" "concise" file)
        :sentinel
        (lambda (proc _event)
          (when (memq (process-status proc) '(exit signal))
            (unwind-protect
                (when (buffer-live-p source)
                  (with-current-buffer (process-buffer proc)
                    (goto-char (point-min))
                    (let (diags)
                      ;; concise format: "file:line:col: severity[code]: message"
                      (while (re-search-forward
                              "^.+:\\([0-9]+\\):\\([0-9]+\\):? *\\(error\\|warning\\|info\\)[^:]*: *\\(.+\\)$"
                              nil t)
                        (let* ((line (string-to-number (match-string 1)))
                               (col  (string-to-number (match-string 2)))
                               (sev  (match-string 3))
                               (msg  (match-string 4))
                               (type (pcase sev
                                       ("error"   :error)
                                       ("warning" :warning)
                                       (_         :note)))
                               (region (with-current-buffer source
                                         (flymake-diag-region source line col))))
                          (when region
                            (push (flymake-make-diagnostic
                                   source (car region) (cdr region)
                                   type (concat "[ty] " msg))
                                  diags))))
                      (funcall report-fn diags))))
              (kill-buffer (process-buffer proc))))))))))

(defun jds/enable-ty-flymake ()
  (add-hook 'flymake-diagnostic-functions #'jds/flymake-ty-backend nil t))

(add-hook 'python-base-mode-hook #'jds/enable-ty-flymake)

(use-package rustic
  :straight t
  :bind (:map rustic-mode-map
              ("M-j" . imenu)
              ("M-?" . xref-find-references)
              ("C-c C-c l" . flymake-show-buffer-diagnostics)
              ("C-c C-c a" . eglot-code-actions)
              ("C-c C-c r" . eglot-rename)
              ("C-c C-c q" . eglot-reconnect)
              ("C-c C-c Q" . eglot-shutdown))
  :custom
  (rustic-lsp-client 'eglot)
  (rustic-lsp-server 'rust-analyzer)
  (rustic-analyzer-command '("rustup run stable rust-analyzer"))
  :config
  (setq rustic-format-on-save t))

(setq fortran-comment-region "!"
      fortran-line-length 200)
