.emacs.d/jds-config.org
*** Markdown

=markdown-mode= is mature and battle-tested (still preferred over the
treesit variant). =markdown-fontify-code-blocks-natively= turns on
syntax highlighting inside fenced code blocks using the appropriate
major mode. =marksman= is a fast LSP for cross-document refs / wiki
links — useful in docs-heavy projects. Install:

- macOS: =brew install marksman=
- Linux: grab the static binary from
  https://github.com/artempyanykh/marksman/releases and drop it on
  =$PATH= (no distro packages I'm aware of).

#+begin_src emacs-lisp
  (use-package markdown-mode
    :straight t
    :mode (("\\.md\\'"       . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :hook ((markdown-mode . pandoc-mode)
           (markdown-mode . visual-line-mode))
    :custom
    (markdown-fontify-code-blocks-natively t)
    (markdown-header-scaling t)
    (markdown-hide-urls nil))

  (use-package pandoc-mode
    :straight t)

  (with-eval-after-load 'eglot
    (add-to-list 'eglot-server-programs
                 '(markdown-mode . ("marksman"))))
#+end_src

**** Reading mode for prose

A single toggle that combines:

- =markdown-toggle-markup-hiding= — hide =*=, =_=, =[]()= so headings,
  bold, italics, and links show clean
- =mixed-pitch-mode= — proportional font for prose, monospace stays
  on code blocks and inline =verbatim=
- =olivetti-mode= — centered narrow column (~80ch) for comfortable
  line length

=M-x jds/markdown-reading-mode= flips between the two states. Pairs
with the existing =visual-line-mode= (soft wrap) for a clean reading
view without leaving Emacs.

#+begin_src emacs-lisp
  (use-package olivetti
    :straight t
    :custom (olivetti-body-width 80))

  (use-package mixed-pitch
    :straight t
    :config
    ;; Keep tables, code blocks, inline code, and anything else
    ;; alignment-sensitive in monospace, even with mixed-pitch on.
    (dolist (face '(markdown-table-face
                    markdown-code-face
                    markdown-inline-code-face
                    markdown-pre-face
                    markdown-language-keyword-face
                    markdown-language-info-face
                    markdown-url-face))
      (add-to-list 'mixed-pitch-fixed-pitch-faces face)))

  (define-minor-mode jds/markdown-reading-mode
    "Toggle prose-friendly rendering for a markdown buffer."
    :lighter " 📖"
    (if jds/markdown-reading-mode
        (progn
          (markdown-toggle-markup-hiding 1)
          (mixed-pitch-mode 1)
          (olivetti-mode 1))
      (markdown-toggle-markup-hiding -1)
      (mixed-pitch-mode -1)
      (olivetti-mode -1)))
#+end_src

**** Live preview via pandoc (built into markdown-mode)

=markdown-mode= has =markdown-live-preview-mode= built in: it renders
the buffer with whatever shell command =markdown-command= names and
shows the result in a side-window EWW buffer. The preview
auto-refreshes as you type. Fully local, no server, no tokens, no
external service.

We point =markdown-command= at =pandoc= with GitHub-flavored markdown
input and HTML5 output. Install pandoc:

- macOS: =brew install pandoc=
- Debian/Ubuntu: =sudo apt install pandoc=
- Fedora/RHEL: =sudo dnf install pandoc=
- Arch: =sudo pacman -S pandoc=

- =C-c C-c l= — toggle =markdown-live-preview-mode= (live EWW buffer)
- =C-c C-c p= — one-shot =markdown-preview= (opens once in default
  browser; doesn't refresh)
- =C-c C-c v= — =markdown-export-and-preview= (export to file, open
  in browser)

#+begin_src emacs-lisp
  (with-eval-after-load 'markdown-mode
    (setq markdown-command "pandoc -f gfm -t html5 --standalone"))
#+end_src

*** TOML

Tree-sitter-backed mode comes from =toml-ts-mode= (built-in; grammar
auto-installed by =treesit-auto=). =taplo= is the LSP — formatter +
schema-aware validation (it knows =pyproject.toml=,
=Cargo.toml=, etc.). Install:

- macOS: =brew install taplo=
- Cross-platform: =cargo install taplo-cli --features lsp= (needs
  Rust toolchain), or download a release binary from
  https://github.com/tamasfe/taplo/releases

#+begin_src emacs-lisp
  (with-eval-after-load 'eglot
    (add-to-list 'eglot-server-programs
                 '(toml-ts-mode . ("taplo" "lsp" "stdio"))))

  (add-hook 'toml-ts-mode-hook #'eglot-ensure)
#+end_src

*** YAML

=yaml-ts-mode= (built-in; grammar via =treesit-auto=). The LSP is
=yaml-language-server= (Red Hat), which understands K8s manifests,
GitHub Actions, GitLab CI, JSON Schema, and a bunch of others.
Install:

- macOS: =brew install yaml-language-server=
- Cross-platform: =npm install -g yaml-language-server= (needs
  Node), or grab a release from
  https://github.com/redhat-developer/yaml-language-server/releases

YAML is whitespace-sensitive so we also pin indentation explicitly.

#+begin_src emacs-lisp
  (with-eval-after-load 'eglot
    (add-to-list 'eglot-server-programs
                 '(yaml-ts-mode . ("yaml-language-server" "--stdio"))))

  (add-hook 'yaml-ts-mode-hook #'eglot-ensure)
  (add-hook 'yaml-ts-mode-hook
            (lambda ()
              (setq-local tab-width 2
                          yaml-indent-offset 2)))
#+end_src
*** C programming

New modern C setup!

Eglot for LSP-driven completion and diagnostics. =C-c f= aligns the
region. =;;= chord jumps to end-of-line and inserts a semicolon.
=define-key= and =key-chord-define= mutate the mode-map, so they only
need to run once — use =with-eval-after-load= instead of a hook.

#+begin_src emacs-lisp
  (add-hook 'c-mode-hook #'eglot-ensure)
  (add-hook 'c++-mode-hook #'eglot-ensure)

  (with-eval-after-load 'cc-mode
    (define-key c-mode-map   (kbd "C-c f") #'align-current)
    (define-key c++-mode-map (kbd "C-c f") #'align-current)
    (key-chord-define c-mode-map   ";;" "\C-e;")
    (key-chord-define c++-mode-map ";;" "\C-e;"))
#+end_src

*** CUDA
#+begin_src emacs-lisp
  (use-package cuda-mode
    :straight t
    :init (progn
      (add-to-list 'auto-mode-alist '("\\.cuh\\'" . cuda-mode))))

  (add-hook 'cuda-mode-hook #'eglot-ensure)
#+end_src

*** PlantUML

Locate the =plantuml= binary on PATH (works on macOS Homebrew at
=/opt/homebrew/bin=, Linux distros at =/usr/bin=, manual installs in
=~/.local/bin=, etc.). Falls back to the bare command name so
plantuml-mode can still error usefully if it's not installed.

#+begin_src emacs-lisp
  (use-package plantuml-mode
    :straight t
    :init
    (setq plantuml-executable-path (or (executable-find "plantuml")
                                       "plantuml")
          plantuml-default-exec-mode 'executable))
#+end_src

*** Lua
#+begin_src emacs-lisp
  (use-package lua-mode
    :straight t
    :config (add-to-list 'auto-mode-alist '("\\.lua$" . lua-mode)))
#+end_src

* Back Matter

They say you need this:

#+begin_src emacs-lisp
  (provide 'dot-emacs)
  ;;; dot-emacs ends here
#+end_src
