.emacs.d/init.el

(use-package pandoc-mode
  :straight t)
(use-package markdown-mode
  :straight t
  :init (progn
    (add-hook 'markdown-mode-hook 'pandoc-mode)))

(add-hook 'c-mode-hook #'eglot-ensure)
(add-hook 'c++-mode-hook #'eglot-ensure)

(with-eval-after-load 'cc-mode
  (define-key c-mode-map   (kbd "C-c f") #'align-current)
  (define-key c++-mode-map (kbd "C-c f") #'align-current)
  (key-chord-define c-mode-map   ";;" "\C-e;")
  (key-chord-define c++-mode-map ";;" "\C-e;"))

(use-package cuda-mode
  :straight t
  :init (progn
    (add-to-list 'auto-mode-alist '("\\.cuh\\'" . cuda-mode))))

(add-hook 'cuda-mode-hook #'eglot-ensure)

(use-package plantuml-mode
  :straight t
  :init (progn
    (setq plantuml-executable-path "/usr/bin/plantuml")
    (setq plantuml-default-exec-mode 'executable)))

(use-package lua-mode
  :straight t
  :config (add-to-list 'auto-mode-alist '("\\.lua$" . lua-mode)))

(provide 'dot-emacs)
;;; dot-emacs ends here
